{
  "backend/main.mo": "Motoko actor implementing a horse racing betting system with value bet detection, trust weight tracking per odds range, race history logging, and ROI calculation.",
  "feature_evidence.json": "Feature evidence report documenting planned enhancements to ModelState interface, storage initialization, and statistics calculation functions for signal weights and calibration parameters.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, utilities, and type definitions for the betting workflow application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining racing-inspired theme variables for light and dark modes with bold orange/gold accents.",
  "frontend/index.html": "HTML entry point for the GTA Horse Betting Assistant application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component wrapping BettingWorkflow with ThemeProvider, Layout, and Toaster for notifications.",
  "frontend/src/components/BettingWorkflow.tsx": "Main workflow orchestrator managing three-tab navigation (Dashboard, Odds Entry, Prediction+Results) with phase state machine and automatic reset after result logging.",
  "frontend/src/components/Dashboard.tsx": "Dashboard screen displaying ROIDashboard performance metrics and instructional cards explaining the four-step betting workflow.",
  "frontend/src/components/Layout.tsx": "Application layout with racing-themed header featuring trophy icon and title, plus footer with caffeine.ai attribution link.",
  "frontend/src/components/OddsEntryForm.tsx": "Form component for entering horse names and betting odds with validation for minimum 2 horses, positive odds, and unique names. Manages dynamic horse input fields with add/remove functionality.",
  "frontend/src/components/PredictionAndResults.tsx": "Combined component that displays value bet predictions with bucket-adjusted probabilities and handles race result logging. Integrates historical bucket statistics to adjust implied probabilities and normalizes them for recommendations.",
  "frontend/src/components/PredictionDisplay.tsx": "Displays recommended picks based on odds-anchored probability analysis and identifies value bets. Shows normalized probabilities and highlights the top pick with value bet indicators.",
  "frontend/src/components/ResultLogger.tsx": "Component for selecting and logging the winning horse after a race completes. Calculates normalized probabilities and submits race outcomes to update the learning system.",
  "frontend/src/components/ROIDashboard.tsx": "Dashboard component showing overall betting performance metrics (ROI, win rate, total races) and odds bucket performance statistics. Subscribes to storage changes for real-time updates.",
  "frontend/src/components/WorkflowIndicator.tsx": "Visual indicator showing the current phase in the betting workflow (Entry, Predict, Log, Learn) with icons and progress tracking.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance with Internet Identity authentication. Handles actor creation with optional identity and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useBettingHistory.ts": "React hook that loads betting history from AsyncStorage, subscribes to storage changes for real-time updates, and provides loading/error states with a manual refresh function.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching value bets, logging races, retrieving race history, ROI, and trust weights from the backend actor with automatic cache invalidation.",
  "frontend/src/hooks/useRaceStorage.ts": "React hook for asynchronously logging race data to storage, automatically rebuilding derived statistics and notifying listeners of changes.",
  "frontend/src/hooks/useStorageRebuild.ts": "React hook that provides manual rebuilding of derived statistics from race records with loading/error/success states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including sidebar, charts, and UI component tokens.",
  "frontend/src/lib/immutable.ts": "Utility functions for deep freezing objects to enforce runtime immutability, checking freeze status, and creating immutable copies via JSON serialization.",
  "frontend/src/lib/statsCalculator.ts": "Pure functions for calculating betting statistics and odds bucket metrics (1-2, 3-5, 6-10, 11-30 ranges) including ROI, win rates, variance, and recent performance from race records.",
  "frontend/src/lib/storage.ts": "AsyncStorage wrapper for localStorage providing typed read/write operations, immutable race record creation, and automatic calculation of derived statistics with error handling for quota and corruption.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for React Query and ICP authentication.",
  "frontend/src/types/storage.ts": "Defines TypeScript interfaces for AsyncStorage data structures including race records, model state with signal weights, betting history, and odds bucket statistics for persistent race tracking and machine learning.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom font families (Inter and JetBrains Mono).",
  "project_state.json": "Project metadata defining a GTA Online horse betting assistant with odds-anchored predictions, incremental learning system, and a three-screen workflow loop (Dashboard → Odds Entry → Prediction/Results) that resets after each race."
}