{
  "backend/main.mo": "Motoko actor implementing horse racing value bet detection with trust weights per odds range, race history logging, and ROI calculation based on actual outcomes.",
  "feature_evidence.json": "Feature evidence report documenting implemented AsyncStorage-based data persistence, immutable race records, and derived statistics rebuild capabilities with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files describing the betting workflow UI, AsyncStorage integration, immutability enforcement, and statistics calculation.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining racing-themed design tokens for light and dark modes with bold orange/gold accents.",
  "frontend/index.html": "HTML entry point for the GTA Horse Betting Assistant application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component wrapping BettingWorkflow with ThemeProvider, Layout, and Toaster for notifications.",
  "frontend/src/components/BettingWorkflow.tsx": "Main workflow orchestrator managing three-tab navigation (Dashboard, Odds Entry, Prediction+Results) with phase state machine and automatic reset after result logging.",
  "frontend/src/components/Dashboard.tsx": "Primary dashboard screen displaying ROIDashboard performance metrics and instructional cards explaining the four-step betting workflow.",
  "frontend/src/components/Layout.tsx": "Application layout with racing-themed header featuring trophy icon and title, plus footer with caffeine.ai attribution link.",
  "frontend/src/components/OddsEntryForm.tsx": "Form component for entering horse names and odds with validation for minimum 2 horses, positive odds, and unique names. Manages dynamic horse input list with add/remove functionality.",
  "frontend/src/components/PredictionAndResults.tsx": "Combined component that displays value bet predictions and handles race result logging. Calculates normalized probabilities, identifies top picks, and logs race outcomes with signal data and model weights to storage.",
  "frontend/src/components/PredictionDisplay.tsx": "Displays recommended betting picks based on odds-anchored probability analysis. Shows top pick with normalized win probability and identifies value bets by comparing odds.",
  "frontend/src/components/ResultLogger.tsx": "Component for selecting the winning horse and logging race results. Calculates predicted probabilities and marks actual outcomes before submitting to the learning system.",
  "frontend/src/components/ROIDashboard.tsx": "Dashboard widget displaying betting performance metrics including cumulative ROI, total races, and win rate. Uses sticky positioning and loads data from betting history hook.",
  "frontend/src/components/WorkflowIndicator.tsx": "Progress indicator showing current phase in the betting workflow (Entry, Predict, Log, Learn). Displays phase icon, label, and step counter.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing authenticated or anonymous backend actor instances. Handles identity-based actor creation and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useBettingHistory.ts": "Hook for reading betting history from AsyncStorage with real-time updates via storage change subscriptions. Provides loading state, error handling, and manual refresh capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching value bets, logging races, retrieving race history, ROI, and trust weights from the backend actor.",
  "frontend/src/hooks/useRaceStorage.ts": "React hook that provides async race logging to localStorage, updating derived statistics and notifying listeners on successful writes.",
  "frontend/src/hooks/useStorageRebuild.ts": "React hook for manually rebuilding all derived statistics from stored race records, useful for data recovery scenarios.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes, including sidebar, chart, and semantic color tokens.",
  "frontend/src/lib/immutable.ts": "Utility functions for deep freezing objects to enforce runtime immutability, including freeze verification and immutable copy creation.",
  "frontend/src/lib/statsCalculator.ts": "Pure functions for calculating betting history and odds bucket statistics from race records, including ROI, win rate, and trust weight computations.",
  "frontend/src/lib/storage.ts": "AsyncStorage wrapper for localStorage providing typed read/write operations for race records, model state, betting history, and odds bucket stats with error handling and immutability enforcement.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/types/storage.ts": "TypeScript type definitions for storage data structures including immutable race records, model state, betting history, and odds bucket statistics.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, extended theme settings for containers, border radius, fonts (Inter, JetBrains Mono), and animation keyframes for accordion and other UI components.",
  "project_state.json": "Project state document describing a GTA Online horse betting assistant with odds-anchored predictions, incremental learning, and a three-screen workflow (Dashboard, Odds Entry, Prediction+Results) that resets after each race cycle."
}