{
  "backend/main.mo": "Motoko actor implementing a horse racing betting backend with race logging, trust weight tracking per odds range, value bet detection based on odds and predicted probabilities, and ROI calculation across race history.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for redesigning the PredictionAndResults component with strategy mode display, best bet panel, and signal breakdown section.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including components, hooks, utilities, and type definitions for the betting workflow application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for racing-inspired UI with bold orange/gold accents.",
  "frontend/index.html": "HTML entry point for the GTA Horse Betting Assistant application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component wrapping BettingWorkflow with ThemeProvider, Layout, and Toaster for notifications.",
  "frontend/src/components/BettingWorkflow.tsx": "Main workflow orchestrator managing three-tab navigation (Dashboard, Odds Entry, Prediction+Results) with phase state machine, handling odds data flow and automatic reset after result logging.",
  "frontend/src/components/Dashboard.tsx": "Primary dashboard screen displaying ROIDashboard performance metrics alongside instructional cards explaining the four-step betting workflow.",
  "frontend/src/components/Layout.tsx": "Application layout with racing-themed header featuring trophy icon and app title, plus footer with caffeine.ai attribution link.",
  "frontend/src/components/OddsEntryForm.tsx": "Form component for entering six race odds (1-30) with strategy mode selection (Safe/Balanced/Value/Aggressive), featuring auto-focus, Enter-key navigation, implied probability calculations, and overround detection.",
  "frontend/src/components/PredictionAndResults.tsx": "Main component that displays value bet predictions using bucket-adjusted probabilities, shows signal breakdowns with hot/trap bucket indicators, handles winner selection, and logs race results with bet sizing recommendations.",
  "frontend/src/components/PredictionDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/ResultLogger.tsx": "Empty file with no content.",
  "frontend/src/components/ROIDashboard.tsx": "Dashboard component displaying cumulative ROI, win rate, total races, and confidence-segmented statistics by odds bucket ranges (1-2, 3-5, 6-10, 11-30) with real-time updates via storage subscriptions.",
  "frontend/src/components/WorkflowIndicator.tsx": "Badge component showing current workflow phase (Entry/Predict/Log/Learn) with icons and progress indicator (1/4 through 4/4).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBettingHistory.ts": "Hook that loads betting history from AsyncStorage with real-time updates via storage change subscriptions, providing loading state and manual refresh capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including value bet calculation, race logging, race history retrieval, ROI fetching, and trust weight queries.",
  "frontend/src/hooks/useRaceStorage.ts": "Hook for logging race data to storage with automatic derived statistics rebuilding and storage change notifications, providing async operation state management.",
  "frontend/src/hooks/useStorageRebuild.ts": "React hook that provides manual data recovery functionality by rebuilding derived statistics from race records and notifying storage change listeners.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements using OKLCH color space.",
  "frontend/src/lib/immutable.ts": "Utility functions for enforcing runtime immutability through deep freezing objects and arrays, including validation and immutable copy creation.",
  "frontend/src/lib/statsCalculator.ts": "Pure functions for calculating betting statistics and odds bucket analytics from race records, implementing a four-bucket classification system (1-2, 3-5, 6-10, 11-30) with nine metrics per bucket including win rates, ROI, variance, and recent performance.",
  "frontend/src/lib/storage.ts": "AsyncStorage wrapper for browser localStorage providing typed read/write operations with error handling, immutable race record creation, and automatic calculation of derived statistics (betting history and odds bucket stats).",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/types/storage.ts": "TypeScript type definitions for the complete data model including immutable race records, betting history, odds bucket statistics, model state with signal weights, and confidence-segmented performance metrics.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, container settings, border radius variables, custom fonts (Inter and JetBrains Mono), and accordion animations.",
  "project_state.json": "Project state file tracking a GTA Online horse betting assistant with odds-anchored predictions, incremental learning, and a streamlined workflow (Enter Odds → Get Pick → Log Results → Learn → Reset). Documents 18 existing features including odds entry, prediction display, result logging, ROI dashboard, and UI/UX improvements with racing aesthetics."
}