{
  "backend/main.mo": "Motoko actor implementing horse racing bet tracking with odds-to-probability conversion, trust weight updates per odds range, value bet identification, race history logging, and ROI calculation across all logged races.",
  "feature_evidence.json": "Feature evidence report documenting visual theme redesign with OKLCH color system, typography updates using Inter and JetBrains Mono, and layout component enhancements with gold accents and animations.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend components including App entry point, custom hooks, layout, workflow orchestrator, odds entry form, prediction display, result logger, ROI dashboard, styling configurations, and type definitions.",
  "frontend/index.css": "Tailwind CSS base layer defining CSS custom properties for light and dark themes using OKLCH color values for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'GTA Horse Betting Assistant', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping BettingWorkflow in Layout and ThemeProvider (dark mode default), with Sonner toaster configured using premium shadow and color token classNames.",
  "frontend/src/components/BettingWorkflow.tsx": "Main workflow state machine managing three phases (dashboard, odds-entry, prediction) with pill-style tab navigation, strategy mode selection, and callbacks for race start, odds submission, and race completion.",
  "frontend/src/components/Dashboard.tsx": "Performance dashboard displaying animated metrics (ROI, win rate, profit, races), session vs lifetime toggle, calibration status, model health indicators, odds bucket performance bars, and hero START NEW RACE button with gold gradient.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header with app branding, main content area, and footer with attribution link to caffeine.ai.",
  "frontend/src/components/OddsEntryForm.tsx": "Form for entering 6 horse odds (1-30) with auto-advance, strategy mode selector (safe/balanced/value/aggressive), and implied probability calculation using 1/(odds+1) formula with overround validation.",
  "frontend/src/components/PredictionAndResults.tsx": "Five-step prediction engine that calculates adjusted probabilities using implied odds, bucket adjustments, signal weights, and calibration; allows user to select race results (1st/2nd/3rd) and logs outcomes to storage.",
  "frontend/src/components/PredictionDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/ResultLogger.tsx": "Empty file with no content.",
  "frontend/src/components/ROIDashboard.tsx": "Dashboard displaying cumulative ROI, win rate, total races, and odds bucket statistics (1-2, 3-5, 6-10, 11-30) with confidence-segmented stats; subscribes to storage changes for real-time updates.",
  "frontend/src/components/Settings.tsx": "Settings dialog providing undo last race, soft reset (clears session stats), full reset (deletes all data), and export data functionality with confirmation dialogs.",
  "frontend/src/components/WorkflowIndicator.tsx": "Badge component showing current workflow phase (Entry/Predict/Log/Learn) with icon and step counter (1/4 through 4/4).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor with Internet Identity authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBettingHistory.ts": "Hook that loads betting history from storage, subscribes to storage changes for real-time updates, and provides loading/error states with manual refresh capability.",
  "frontend/src/hooks/useCountAnimation.ts": "Custom React hook that animates number transitions from old to new values using requestAnimationFrame with an ease-out cubic easing function over a configurable duration (default 500ms).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, providing login/logout functionality, identity management, and authentication status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching value bets, logging races, retrieving race history, ROI, and trust weights from the backend actor with automatic cache invalidation on mutations.",
  "frontend/src/hooks/useRaceStorage.ts": "React hook that provides async race logging functionality with automatic bucket statistics recalculation and storage change notifications.",
  "frontend/src/hooks/useStorageRebuild.ts": "React hook for manually rebuilding derived statistics from stored race data, providing data recovery functionality with loading and error states.",
  "frontend/src/hooks/useUndoRace.ts": "React hook that provides functionality to undo the last logged race with loading and error state management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, custom animations (shimmer, pulse-glow, fade-in-up, slide-in), and enhanced typography settings.",
  "frontend/src/lib/immutable.ts": "Utility functions for deep freezing objects and arrays to enforce runtime immutability, including checks for frozen state and creating immutable copies via JSON serialization.",
  "frontend/src/lib/statsCalculator.ts": "Pure functions for calculating betting statistics including cumulative ROI, odds bucket classification (1-2, 3-5, 6-10, 11-30), bucket-level performance metrics, variance, and implied probabilities using the formula 1/(odds+1).",
  "frontend/src/lib/storage.ts": "LocalStorage wrapper for race betting data with session tracking, race record management, automatic validation/correction of implied probabilities using 1/(odds+1), derived statistics calculation, and storage change notifications.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging in React components.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient provider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/types/storage.ts": "Complete TypeScript type definitions for race betting storage including race records, betting history, odds buckets, model state, signal weights, and calibration structures. Emphasizes that implied probabilities must be calculated using 1/(odds+1) formula.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended border radius, shadow utilities, and typography/animation plugins for a racing-themed UI.",
  "project_state.json": "Project metadata defining a GTA Online horse betting assistant with odds-anchored predictions and incremental learning. Documents known issue with implied probability calculation potentially using 1/X instead of correct 1/(X+1) formula."
}