{
  "backend/main.mo": "Motoko backend actor managing horse race betting with odds-to-probability conversion, trust weight tracking per odds range, value bet identification, race history logging, and ROI calculation across all recorded races.",
  "feature_evidence.json": "Feature evidence report documenting four features related to OddsEntryForm improvements: removing single-character auto-advance, implementing Enter key navigation, updating validation to blur/submit only, and ensuring manual focus navigation works correctly.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx, hooks, components (Layout, BettingWorkflow, OddsEntryForm, PredictionDisplay, ResultLogger, ROIDashboard, Dashboard, PredictionAndResults), styling files, and type definitions.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with variables for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'GTA Horse Betting Assistant', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping BettingWorkflow in ThemeProvider (dark mode default) and Layout, with Toaster configured for top-right notifications using premium card styling.",
  "frontend/src/components/BettingWorkflow.tsx": "Main workflow orchestrator managing three phases (dashboard, odds-entry, prediction) with tab navigation, state for odds data and strategy mode, and handlers for race start, odds submission, and race completion.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component displaying betting statistics with session/lifetime view toggle, animated metrics using useCountAnimation, model health indicators (calibration, drift), odds bucket performance, and hero START NEW RACE button with gradient styling.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, footer, and content area. Displays app branding with Sparkles icon and includes a footer with caffeine.ai attribution link.",
  "frontend/src/components/OddsEntryForm.tsx": "Form component for entering 6 horse odds (1-30 range) with validation, auto-focus, Enter-key navigation, and strategy mode selection (safe/balanced/value/aggressive). Calculates implied probabilities using 1/(odds+1) formula.",
  "frontend/src/components/PredictionAndResults.tsx": "Displays predictions for each horse using a five-step engine (implied probability, bucket classification, adjustments, signal weights, calibration) and handles winner/place selection for logging race results. Normalizes probabilities and calculates value edges.",
  "frontend/src/components/PredictionDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/ResultLogger.tsx": "Empty file with no content.",
  "frontend/src/components/ROIDashboard.tsx": "Dashboard displaying cumulative ROI, win rate, total races, and odds bucket statistics with real-time updates via storage subscription. Shows confidence-segmented stats and performance metrics.",
  "frontend/src/components/Settings.tsx": "Settings dialog with undo last race, soft reset (clears session stats), full reset (deletes all data), and export functionality. Uses confirmation dialogs for destructive actions.",
  "frontend/src/components/WorkflowIndicator.tsx": "Displays current workflow phase badge (Entry/Predict/Log/Learn) with icon and step counter (1-4). Shows progress through the betting workflow.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instances with Internet Identity authentication. Creates anonymous or authenticated actors and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useBettingHistory.ts": "Hook for loading betting history from storage with real-time updates via storage change subscription. Returns history data, loading state, error state, and refresh function.",
  "frontend/src/hooks/useCountAnimation.ts": "Custom React hook that animates number transitions from old to new values using requestAnimationFrame with an ease-out cubic easing function over a configurable duration (default 500ms).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, providing login/logout functionality, identity management, and authentication status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend actor interactions including fetching value bets, logging races, retrieving race history, ROI calculations, and trust weights with automatic query invalidation on mutations.",
  "frontend/src/hooks/useRaceStorage.ts": "React hook for asynchronously logging race data to storage with automatic derived statistics recalculation and storage change notifications, including loading and error state management.",
  "frontend/src/hooks/useStorageRebuild.ts": "React hook providing manual rebuild functionality for derived statistics from stored race data, useful for data recovery with success/error state tracking.",
  "frontend/src/hooks/useUndoRace.ts": "React hook that provides functionality to undo the last logged race with loading and error state management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, including refined neutral palettes, custom animations (shimmer, pulse-glow, fade-in-up, slide-in), and typography enhancements.",
  "frontend/src/lib/immutable.ts": "Utility functions for enforcing runtime immutability through deep freezing of objects and arrays, including validation and immutable copy creation.",
  "frontend/src/lib/statsCalculator.ts": "Pure functions for calculating betting statistics from race records including ROI, win rates, odds bucket classification (1-2, 3-5, 6-10, 11-30), variance, recent performance, and model calibration using the implied probability formula 1/(odds+1).",
  "frontend/src/lib/storage.ts": "LocalStorage wrapper for race betting data with session tracking, CRUD operations, undo functionality, data export, and automatic validation/correction of implied probabilities using the formula 1/(odds+1) with storage change notifications.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging in React components.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/types/storage.ts": "TypeScript type definitions for race betting system including race records, betting history, odds bucket statistics, model state with signal weights, and confidence-segmented performance tracking. Critical note: implied probabilities must be calculated as 1/(odds+1).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended border radius variables, custom shadows including glow effects, and typography/container query plugins.",
  "project_state.json": "Project metadata describing a GTA Online horse betting assistant with odds-anchored predictions and incremental learning. Documents known issues with implied probability calculation (1/X vs 1/(X+1)) and auto-advance preventing two-digit odds entry."
}