{
  "kind": "build_request",
  "title": "Fix odds input auto-advance to allow two-digit entry",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-126",
      "text": "Remove single-character auto-advance logic from OddsEntryForm component in frontend/src/components/OddsEntryForm.tsx. Delete any onChange handler or input event listener that automatically moves focus to the next field after a single character is entered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Auto-advance must NOT trigger after a single keystroke.",
          "Do NOT auto-advance based solely on input length."
        ]
      },
      "acceptanceCriteria": [
        "Typing a single digit (e.g., '1') does not automatically move focus to the next field",
        "User can continue typing in the same field to enter two-digit values (e.g., '10', '20', '30')",
        "No focus change occurs based on input length"
      ]
    },
    {
      "id": "REQ-127",
      "text": "Implement Enter key handler in OddsEntryForm that advances focus to the next odds input field when the user presses Enter or the keyboard 'Next' key. For fields #1 through #5, pressing Enter should move focus to the next sequential field. For field #6, pressing Enter should submit the form if all validation passes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "User presses the keyboard 'Enter' or 'Next' key",
          "User presses Enter → focus moves to next field"
        ]
      },
      "acceptanceCriteria": [
        "Pressing Enter in field #1 moves focus to field #2",
        "Pressing Enter in field #2 moves focus to field #3",
        "Pressing Enter in field #3 moves focus to field #4",
        "Pressing Enter in field #4 moves focus to field #5",
        "Pressing Enter in field #5 moves focus to field #6",
        "Pressing Enter in field #6 with all valid odds entered submits the form"
      ]
    },
    {
      "id": "REQ-128",
      "text": "Update odds input validation in OddsEntryForm to validate on blur (when focus leaves the field) or on form submit, not on every character input. Accept integers from 1 to 30. Allow 1 or 2 digit input without interruption. Display validation error feedback only after the user has finished editing the field (blur event) or attempts to submit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Validate on blur or submit, not per character",
          "Typing must be uninterrupted.",
          "Accept integers from 1 to 30",
          "Allow 1 or 2 digits"
        ]
      },
      "acceptanceCriteria": [
        "User can type '1' and continue typing '0' to enter '10' without validation errors appearing",
        "Validation error appears only when user leaves the field (blur) with invalid value",
        "Validation error appears when user tries to submit with invalid or empty fields",
        "No validation feedback displays while user is actively typing",
        "Values outside 1-30 range are rejected on blur or submit",
        "Non-integer values are rejected on blur or submit"
      ]
    },
    {
      "id": "REQ-129",
      "text": "Ensure manual focus navigation in OddsEntryForm continues to work as expected. User should be able to manually tap/click into any odds input field at any time without interference from auto-advance logic. Tab key navigation between fields should work normally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "User manually taps into the next field"
        ]
      },
      "acceptanceCriteria": [
        "User can click/tap any odds input field to focus it",
        "Tab key moves focus to the next field normally",
        "Shift+Tab moves focus to the previous field normally",
        "Manual navigation is not blocked or interfered with by any auto-advance code"
      ]
    },
    {
      "id": "REQ-130",
      "text": "Update the real-time implied probability display logic in OddsEntryForm to recalculate and display implied probability using the formula 1/(odds+1) as the user types valid odds values, but without triggering focus changes. Implied probability should update in real-time while the user remains focused in the current field.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Typing must be uninterrupted."
        ]
      },
      "acceptanceCriteria": [
        "Implied probability updates in real-time as user types valid odds",
        "Real-time calculation does not cause focus to leave the current input field",
        "Total implied probability and overround warning update in real-time without disrupting input"
      ]
    }
  ],
  "constraints": [
    "Do not modify the existing validation range (1-30 for odds values)",
    "Preserve the strategy mode selector persistence behavior",
    "Maintain the existing submit button enable/disable logic based on all six fields having valid values",
    "Keep the auto-focus behavior that starts on field #1 when the screen loads",
    "Do not change the implied probability formula (1/(odds+1)) that was corrected in previous requirements"
  ],
  "nonGoals": [
    "Changing the visual styling or layout of the odds entry form",
    "Modifying the strategy mode selector behavior",
    "Changing the submit button label or positioning",
    "Adding new validation rules beyond the existing 1-30 integer range",
    "Modifying the total implied probability or overround calculation logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}