{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign UI with enhanced visual personality and immaculate aesthetic polish",
  "requirements": [
    {
      "id": "REQ-116",
      "summary": "Redesign overall visual theme with sophisticated dark aesthetic using deep charcoal, gold accents, crimson warnings, and electric cyan highlights",
      "acceptanceCriteria": [
        "Deep charcoal background creates premium dark interface",
        "Gold, crimson, and cyan accent colors provide visual hierarchy",
        "All text maintains WCAG AA contrast ratios against backgrounds",
        "Color palette feels cohesive and intentional across all screens"
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Replace current racing-inspired theme with refined dark color system. Update CSS variables to use deep charcoal backgrounds (oklch(0.15 0.01 240)), rich card surfaces (oklch(0.18 0.015 240)), gold accents (oklch(0.75 0.15 85)) for primary actions, crimson (oklch(0.55 0.20 25)) for warnings, and electric cyan (oklch(0.70 0.18 195)) for informational highlights. Ensure all color definitions maintain WCAG AA contrast ratios."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update theme.extend.colors to align with new sophisticated color palette. Define custom color tokens for gold, crimson, and cyan accents. Update background, foreground, card, border, and accent color definitions to use the new deep charcoal base with premium material surfaces."
        }
      ]
    },
    {
      "id": "REQ-117",
      "summary": "Update typography system with refined font hierarchy using Inter for text and JetBrains Mono for numeric displays",
      "acceptanceCriteria": [
        "Headings use Inter bold with optical sizing",
        "Body text uses Inter with improved letter-spacing",
        "All numeric values use JetBrains Mono with tabular figures",
        "Typography hierarchy creates clear visual structure"
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update typography configuration to refine font hierarchy. Set headings to use Inter with weights 700-800 and optical size adjustments. Configure body text to use Inter weight 400-500 with increased letter-spacing (0.01em). Ensure JetBrains Mono weight 600 with tabular figures is configured for numeric displays. Add custom text styles: display titles (text-2xl font-bold tracking-tight), section headers (text-lg font-semibold tracking-wide uppercase text-muted-foreground), and data values (font-mono text-xl font-semibold tabular-nums)."
        }
      ]
    },
    {
      "id": "REQ-118",
      "summary": "Redesign Layout component header with gradient background, gold border, refined spacing, and subtle animations",
      "acceptanceCriteria": [
        "Header has gradient background and gold accent border",
        "Header branding uses refined typography and spacing",
        "Subtle animations enhance perceived quality",
        "Drop shadow creates depth without overwhelming"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Redesign header with subtle gradient background (from deep charcoal to slightly lighter), thin gold bottom border (1px), and refined drop shadow. Replace trophy icon with more sophisticated icon treatment. Increase header padding and apply new typography system to app title. Add fade-in animation on mount and gentle parallax scroll effect. Update footer styling to match refined aesthetic."
        }
      ]
    },
    {
      "id": "REQ-119",
      "summary": "Redesign Dashboard component with premium card layouts, micro-interactions, and prominent START NEW RACE button",
      "acceptanceCriteria": [
        "Metric cards use premium styling with gradients and shadows",
        "Hover effects provide satisfying tactile feedback",
        "START NEW RACE button is visually dominant with gold treatment",
        "Staggered animations create polished loading experience"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Dashboard.tsx",
          "operation": "modify",
          "description": "Redesign metric cards with subtle background gradients, refined borders with gold accent on hover, generous padding (p-6), rounded corners (rounded-xl), and elegant box shadows (shadow-lg). Organize cards in masonry-style grid with varying heights. Add micro-interactions: cards scale slightly on hover (transform: scale(1.02)), smooth transitions (duration-300), and staggered fade-in animations on load. Transform START NEW RACE button into prominent hero element with gold gradient background, large size, and pulsing glow animation."
        }
      ]
    },
    {
      "id": "REQ-120",
      "summary": "Redesign OddsEntryForm with refined input styling, segmented control strategy selector, and sequential entrance animations",
      "acceptanceCriteria": [
        "Input fields have premium dark styling with gold focus states",
        "Implied probabilities display with cyan accent treatment",
        "Strategy selector uses smooth segmented control design",
        "Sequential entrance animations enhance perceived quality"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Redesign odds input fields with dark background, subtle borders, gold focus ring with glow effect, increased font size (text-2xl), and monospace font. Add visual separators between rows using thin gradient lines. Update implied probability display to use cyan accent color with subtle background pill. Redesign strategy mode selector as segmented control with smooth sliding indicator. Implement sequential entrance animations where each input row fades in with 50ms delay."
        }
      ]
    },
    {
      "id": "REQ-121",
      "summary": "Redesign PredictionAndResults with sophisticated panels, hero BEST BET card, visual confidence indicators, and custom bet slider",
      "acceptanceCriteria": [
        "BEST BET panel is visually prominent with gold treatment",
        "Confidence levels use colored visual indicators",
        "Value Edge displays with directional arrows and color coding",
        "Bet slider has custom styling with real-time feedback",
        "Signal breakdown uses elegant bar chart visualization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Redesign Primary Panel (BEST BET) as hero card with gold gradient border, large typography, and confidence indicator using colored rings (gold=high, amber=medium, crimson=low). Update Value Edge display with visual treatment: positive edges in cyan with upward arrow, negative edges in crimson with downward arrow. Redesign bet size slider with custom thumb styling, gold accent, and real-time value tooltip. Update signal breakdown to use horizontal bar charts with gradient fills. Add smooth transitions between prediction and result logging states."
        }
      ]
    },
    {
      "id": "REQ-122",
      "summary": "Add sophisticated loading states, skeleton loaders, page transitions, custom spinner, and toast notifications",
      "acceptanceCriteria": [
        "Skeleton loaders provide smooth loading experience",
        "Page transitions are smooth and intentional",
        "Loading spinner matches refined visual theme",
        "Toast notifications have premium styling and animations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Dashboard.tsx",
          "operation": "modify",
          "description": "Add skeleton loaders for metric cards with shimmer animations. Implement optimistic UI updates to reduce perceived latency. Add loading states for async data fetching operations."
        },
        {
          "path": "frontend/src/components/BettingWorkflow.tsx",
          "operation": "modify",
          "description": "Add smooth page transitions when navigating between tabs using fade and slide effects (200ms duration with ease-in-out). Implement loading states for workflow phase changes."
        },
        {
          "path": "frontend/src/components/ui/spinner.tsx",
          "operation": "create",
          "description": "Create custom loading spinner component with gold accent that matches refined visual theme. Include size variants and animation with smooth rotation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update Toaster configuration to use refined styling with icons and slide-in animations from top-right. Add success/error toast notification variants with appropriate color treatments."
        }
      ]
    },
    {
      "id": "REQ-123",
      "summary": "Implement refined spacing system, pill-style tab navigation, gradient dividers, and proper focus states throughout UI",
      "acceptanceCriteria": [
        "Generous whitespace creates breathing room",
        "Tab navigation uses polished pill design with sliding indicator",
        "All interactive elements have proper focus states",
        "Touch targets meet accessibility standards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BettingWorkflow.tsx",
          "operation": "modify",
          "description": "Update tab navigation to use pill-style buttons with smooth sliding active indicator and gold accent. Increase spacing between major sections (space-y-8 or space-y-12). Add subtle dividers between sections using gradient lines (from transparent to accent color and back)."
        },
        {
          "path": "frontend/src/components/Dashboard.tsx",
          "operation": "modify",
          "description": "Update spacing to add breathing room to cards (p-6 to p-8) and ensure consistent margins. Verify all interactive elements have proper focus states with visible gold focus rings and adequate touch targets (min 44x44px)."
        },
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Update spacing system with increased whitespace. Ensure all input fields and buttons have proper focus states with gold focus rings and meet minimum touch target sizes."
        },
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Apply refined spacing system with generous padding and margins. Ensure all interactive elements have proper focus states and accessibility-compliant touch targets."
        }
      ]
    },
    {
      "id": "REQ-124",
      "summary": "Add subtle ambient animations including number counting, glow effects, and modal entrance animations",
      "acceptanceCriteria": [
        "Subtle background effects add visual interest without distraction",
        "Number transitions animate smoothly when values change",
        "High-confidence picks have subtle glow treatment",
        "Modals and dialogs have polished entrance animations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCountAnimation.ts",
          "operation": "create",
          "description": "Create custom hook for smooth number counting animations. Animate from old value to new value over 500ms with easing function. Return animated value for display."
        },
        {
          "path": "frontend/src/components/Dashboard.tsx",
          "operation": "modify",
          "description": "Integrate useCountAnimation hook for statistics that update (ROI, win rate, total races). Add subtle sparkle effects on successful race logging. Implement subtle glow effect around high-value metrics."
        },
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Add subtle glow effect around high-confidence picks using CSS box-shadow. Implement smooth transitions when confidence indicators change."
        },
        {
          "path": "frontend/src/components/Settings.tsx",
          "operation": "modify",
          "description": "Add entrance animations for settings dialog with backdrop blur and fade-in effects. Implement smooth scale animation on dialog open."
        }
      ]
    },
    {
      "id": "REQ-125",
      "summary": "Refine Settings component with enhanced visual hierarchy, crimson destructive actions, helper text, and refined dialog design",
      "acceptanceCriteria": [
        "Destructive actions clearly distinguished with crimson treatment",
        "Helper text provides context without cluttering interface",
        "Dialog has refined backdrop and animation treatment",
        "Data counts provide transparency about stored information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Settings.tsx",
          "operation": "modify",
          "description": "Redesign settings actions with enhanced visual hierarchy. Style destructive actions (Full Reset) with crimson treatment, warning icon, and typed confirmation requirement. Apply neutral styling to non-destructive actions and cyan accent to Export button. Add descriptive helper text under each action in muted color. Implement refined dialog design with backdrop blur, smooth scale animation on open, and elegant close button. Add visual indicators showing data counts (e.g., 'X races stored') next to relevant actions."
        }
      ]
    }
  ]
}