{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix odds input auto-advance to allow two-digit entry",
  "requirements": [
    {
      "id": "REQ-126",
      "summary": "Remove single-character auto-advance logic from odds input fields",
      "acceptanceCriteria": [
        "Typing a single digit (e.g., '1') does not automatically move focus to the next field",
        "User can continue typing in the same field to enter two-digit values (e.g., '10', '20', '30')",
        "No focus change occurs based on input length"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Remove any onChange handler logic that automatically moves focus to the next field after a single character is entered. Delete or disable any input event listener that triggers focus change based on input.length === 1 or similar length-based conditions. Preserve the input onChange handler for state updates and real-time probability calculations, but ensure it does not call any focus management methods."
        }
      ]
    },
    {
      "id": "REQ-127",
      "summary": "Implement Enter key handler to advance focus between odds fields",
      "acceptanceCriteria": [
        "Pressing Enter in field #1 moves focus to field #2",
        "Pressing Enter in field #2 moves focus to field #3",
        "Pressing Enter in field #3 moves focus to field #4",
        "Pressing Enter in field #4 moves focus to field #5",
        "Pressing Enter in field #5 moves focus to field #6",
        "Pressing Enter in field #6 with all valid odds entered submits the form"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Add an onKeyDown handler to each odds input field that listens for the Enter key (key === 'Enter' or keyCode === 13). For fields 1-5, when Enter is pressed, programmatically move focus to the next sequential field using ref.current.focus(). For field 6, when Enter is pressed and all validation passes, trigger form submission by calling the existing handleSubmit function. Ensure the handler uses preventDefault() to avoid default form submission behavior on fields 1-5."
        }
      ]
    },
    {
      "id": "REQ-128",
      "summary": "Update odds validation to trigger on blur or submit, not per character",
      "acceptanceCriteria": [
        "User can type '1' and continue typing '0' to enter '10' without validation errors appearing",
        "Validation error appears only when user leaves the field (blur) with invalid value",
        "Validation error appears when user tries to submit with invalid or empty fields",
        "No validation feedback displays while user is actively typing",
        "Values outside 1-30 range are rejected on blur or submit",
        "Non-integer values are rejected on blur or submit"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Refactor validation logic to execute only on blur events and form submit attempts, not during onChange. Add an onBlur handler to each input field that validates the current value (must be an integer from 1 to 30) and updates error state only after the user leaves the field. During onChange, update the input value state and recalculate implied probabilities without performing validation or displaying errors. Ensure error messages are cleared when the user re-focuses a field (onFocus) to provide a clean editing experience. On form submit, validate all six fields and block submission if any field is invalid or empty, displaying appropriate error feedback."
        }
      ]
    },
    {
      "id": "REQ-129",
      "summary": "Ensure manual focus navigation works without interference",
      "acceptanceCriteria": [
        "User can click/tap any odds input field to focus it",
        "Tab key moves focus to the next field normally",
        "Shift+Tab moves focus to the previous field normally",
        "Manual navigation is not blocked or interfered with by any auto-advance code"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Verify that after removing auto-advance logic in REQ-126, all manual focus mechanisms (click, tap, Tab, Shift+Tab) work normally without any programmatic interference. Ensure no event handlers prevent default tab navigation behavior. Test that clicking into any field at any time allows the user to edit that field immediately. Remove any logic that might capture or redirect focus events during manual navigation."
        }
      ]
    },
    {
      "id": "REQ-130",
      "summary": "Update real-time implied probability display to avoid focus changes",
      "acceptanceCriteria": [
        "Implied probability updates in real-time as user types valid odds",
        "Real-time calculation does not cause focus to leave the current input field",
        "Total implied probability and overround warning update in real-time without disrupting input"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsEntryForm.tsx",
          "operation": "modify",
          "description": "Ensure the onChange handler recalculates and displays implied probability using the formula 1/(odds+1) as the user types, but without triggering any focus management. Update the implied probability state and total implied probability display in real-time during onChange without calling focus-related methods. Verify that probability calculations and UI updates do not interfere with the user's ability to continue typing in the current field. The overround warning should also update in real-time based on the total implied probability exceeding 100%."
        }
      ]
    }
  ]
}