{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Define modelState storage schema with comprehensive signal weights and learning parameters",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Expand ModelState interface with nested signalWeights object containing four numeric weight fields",
      "acceptanceCriteria": [
        "ModelState interface includes a signalWeights object with four numeric weight fields",
        "All weight fields are typed as number",
        "TypeScript compilation succeeds with no type errors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/storage.ts",
          "operation": "modify",
          "description": "Add a nested signalWeights object to the ModelState interface containing oddsWeight, historicalBucketWeight, recentBucketWeight, and consistencyWeight fields, all typed as number. The signalWeights object represents the machine learning model's weighting system for different prediction signals."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add five additional learning parameter fields to the ModelState interface",
      "acceptanceCriteria": [
        "ModelState interface includes all five additional fields with correct types",
        "driftDetectionState is typed as an appropriate structure (object or custom interface)",
        "All numeric fields are typed as number",
        "TypeScript compilation succeeds"
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/storage.ts",
          "operation": "modify",
          "description": "Add calibrationScalar (number), confidenceScalingFactor (number), recentAccuracyWindow (number), driftDetectionState (object with appropriate structure for tracking model drift), and raceCount (number) fields to the ModelState interface. These fields support the adaptive learning and calibration system."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Initialize modelState with default values for all new fields when no existing modelState is found",
      "acceptanceCriteria": [
        "readModelState function returns a complete ModelState object with all fields populated",
        "Default values are sensible starting points for the learning system",
        "No undefined or null values in the returned modelState structure"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/storage.ts",
          "operation": "modify",
          "description": "Update the readModelState function to initialize a complete ModelState object with default values for signalWeights (with default numeric values for all four weights), calibrationScalar, confidenceScalingFactor, recentAccuracyWindow, driftDetectionState, and raceCount when no existing modelState is found in localStorage. Ensure all fields are populated with sensible starting values for the learning system and apply deep freeze for immutability."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add writeModelState function to persist ModelState objects with immutability enforcement",
      "acceptanceCriteria": [
        "writeModelState function accepts a ModelState parameter and saves it to localStorage",
        "Function enforces immutability by deep freezing the stored object",
        "Function triggers storage change listeners to notify subscribers",
        "Function returns success or failure status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/storage.ts",
          "operation": "modify",
          "description": "Add a writeModelState function that accepts a ModelState object parameter, deep freezes it for immutability enforcement, persists it to localStorage under the 'modelState' key, triggers storage change listeners to notify all subscribers, and returns a success or failure status. Follow the same pattern as existing write functions in the storage module."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add functions to compute updated signal weights and calibration parameters from race records",
      "acceptanceCriteria": [
        "Functions accept an array of RaceRecord and current ModelState as inputs",
        "Functions return updated ModelState with recalculated signal weights and parameters",
        "Calculation logic is pure and deterministic",
        "Functions include TypeScript type safety for all inputs and outputs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/statsCalculator.ts",
          "operation": "modify",
          "description": "Add pure functions that compute updated signal weights and calibration parameters from an array of RaceRecord and current ModelState inputs. Functions should return an updated ModelState with recalculated signalWeights (oddsWeight, historicalBucketWeight, recentBucketWeight, consistencyWeight) and calibration parameters (calibrationScalar, confidenceScalingFactor, recentAccuracyWindow, driftDetectionState, raceCount). Implement deterministic calculation logic with full TypeScript type safety. These functions prepare the foundation for future integration with the prediction system."
        }
      ]
    }
  ]
}