{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign Prediction Screen with Primary/Secondary Panel Layout",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Redesign PredictionAndResults layout with Strategy Mode header and six-row odds/implied probability display",
      "acceptanceCriteria": [
        "Strategy Mode (Safe/Balanced/Value/Aggressive) is displayed at the top of the prediction screen",
        "All six odds values are displayed with their implied probabilities in a clear row or table format",
        "Each contender is labeled #1 through #6 with its odds and implied probability visible simultaneously"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Restructure the component to add a header section at the top displaying the selected strategy mode and create a six-row table or grid showing all contenders (#1-#6) with their odds and calculated implied probabilities (1/odds). Move existing prediction logic into the new layout structure while preserving calculation and result logging functionality."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Create Primary Panel displaying recommended best bet with predicted probability, implied probability, value edge, confidence level, and recommended bet amount",
      "acceptanceCriteria": [
        "Primary panel is visually distinct and prominent in the layout",
        "Best Bet label clearly shows the contender number (#1-#6) of the recommended pick",
        "Predicted Probability displays the adjusted probability calculated by the prediction engine",
        "Implied Probability shows the baseline 1/odds probability",
        "Value Edge shows the difference between predicted and implied probabilities",
        "Confidence level displays as High, Medium, or Low with appropriate visual styling",
        "Recommended Bet displays the calculated bet size in dollars"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Add a Primary Panel section below the header that displays the recommended contender pick with the label 'BEST BET: #X' where X is the contender number (1-6). Show Predicted Probability (adjusted from prediction engine), Implied Probability (baseline 1/odds), Value Edge (predicted minus implied), Confidence Level (High/Medium/Low with visual indicator like badge or color), and Recommended Bet (dollar amount from bet sizing logic). Use prominent styling with larger font, bold text, or highlighted background to make this panel visually distinct."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Create Secondary Panel displaying signal breakdown with four individual signal contributions",
      "acceptanceCriteria": [
        "Secondary panel is clearly separated from the primary panel but still visible on the same screen",
        "Four distinct signals are displayed with clear labels",
        "Odds Signal shows the baseline implied probability contribution",
        "Historical Bucket Signal shows the adjustment from historical bucket performance (Bucket Win Delta)",
        "Recent Bucket Signal shows the adjustment from recent session performance (Recent Session Delta)",
        "Consistency Signal shows the adjustment from variance-based consistency modifier",
        "Signal values are presented numerically or as percentages with clear formatting"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Add a Secondary Panel section below the Primary Panel that displays a Signal Breakdown showing four individual signal contributions: Odds Signal (baseline implied probability), Historical Bucket Signal (historical bucket win delta contribution), Recent Bucket Signal (recent session delta contribution), and Consistency Signal (variance-based consistency modifier). Display each signal with a clear label and numeric or percentage value. Use visual separation (border, background, spacing) to distinguish this panel from the Primary Panel while keeping it visible on the same screen."
        }
      ]
    },
    {
      "id": "REQ-67",
      "summary": "Add optional Hot Odds Bucket and Trap Odds Bucket informational indicators",
      "acceptanceCriteria": [
        "Hot Odds Bucket displays the odds range (1-2, 3-5, 6-10, or 11-30) with the best recent performance metrics",
        "Trap Odds Bucket displays the odds range with the worst recent performance or highest variance",
        "These indicators are visually distinct but secondary to the main prediction information",
        "Indicators use bucket statistics from oddsBucketStats to determine hot/trap status",
        "Display is optional and can be shown/hidden or placed in a collapsible section"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Add optional informational indicators showing Hot Odds Bucket (the bucket with best recent performance) and Trap Odds Bucket (the bucket with worst recent performance or highest variance). Use oddsBucketStats data to identify the best and worst performing buckets from the four ranges (1-2, 3-5, 6-10, 11-30). Display these indicators in a non-intrusive way below or alongside the Secondary Panel, using subtle styling that doesn't compete with the primary prediction information. Consider making these collapsible or toggleable."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Update signal breakdown calculation logic to return individual signal components as separate numeric values",
      "acceptanceCriteria": [
        "Prediction engine function returns a signalBreakdown object containing four separate signal values",
        "Odds signal represents the baseline implied probability contribution (1/odds)",
        "Historical bucket signal represents the Bucket Win Delta adjustment weight",
        "Recent bucket signal represents the Recent Session Delta adjustment weight",
        "Consistency signal represents the variance-based consistency modifier weight",
        "Signal breakdown values are calculated for the recommended contender and passed to the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/statsCalculator.ts",
          "operation": "modify",
          "description": "Extend the prediction engine function to return a signalBreakdown object containing four separate numeric values: oddsSignal (baseline implied probability 1/odds), historicalBucketSignal (Bucket Win Delta adjustment weight), recentBucketSignal (Recent Session Delta adjustment weight), and consistencySignal (variance-based consistency modifier weight). These values should represent the individual contributions to the final adjusted probability for the recommended contender. Ensure the function signature and return type are updated to include this breakdown while maintaining all existing calculation logic."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Restructure PredictionAndResults layout hierarchy into three distinct visual sections",
      "acceptanceCriteria": [
        "Three distinct sections are visually identifiable with appropriate spacing and borders/backgrounds",
        "Header section appears at the top and contains strategy mode and all odds/probabilities",
        "Primary Panel is prominently displayed with larger text and emphasis on the recommended bet",
        "Secondary Panel is below the Primary Panel but still easily readable",
        "Optional indicators (Hot/Trap buckets) are positioned below or alongside the Secondary Panel",
        "Layout is responsive and maintains hierarchy on different screen sizes",
        "Result logging interface (winner selection) remains accessible below the prediction display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionAndResults.tsx",
          "operation": "modify",
          "description": "Restructure the entire component layout hierarchy to organize content into three distinct visual sections: (1) Header section at the top with Strategy Mode and six-row odds/implied probability display, (2) Primary Panel prominently displaying recommended bet details with larger text and emphasis, (3) Secondary Panel below the Primary Panel with signal breakdown and optional bucket indicators. Use appropriate spacing, borders, backgrounds, or container components to create clear visual hierarchy. Ensure the result logging interface (winner selection) remains accessible below all prediction information. Maintain responsive design so the hierarchy is preserved on different screen sizes."
        }
      ]
    }
  ]
}